pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.h
//---------------------------------------------------------------------------*
//                                                                           *
//                       File 'pic18_optimizations.h'                        *
//                        Generated by version 2.4.3                         *
//                      june 17th, 2013, at 15h21'47"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_optimizations_ENTITIES_DEFINED
#define pic18_optimizations_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_intermediate_next_intruction_is_reachable.h"
#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*
//                                                                           *
//                 Routine 'findFirstInstructionFromAddress'                 *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_findFirstInstructionFromAddress (const GALGAS_uint constinArgument0,
                                              const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument1,
                                              GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument2,
                                              GALGAS_uint & outArgument3,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//             Routine 'findFirstInstructionOrLabelFromAddress'              *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_findFirstInstructionOrLabelFromAddress (const GALGAS_uint constinArgument0,
                                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument1,
                                                     GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument2,
                                                     GALGAS_stringset & outArgument3,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'performOptimizations'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_performOptimizations (GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument0,
                                   GALGAS_string & ioArgument1,
                                   C_Compiler * inCompiler
                                   COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Category method '@pic18_intermediate_instruction defineLabel'       *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabel) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                GALGAS_symbolTableForOptimizations & ioArgument0,
                                                                                                const GALGAS_uint constinArgument1,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_defineLabel (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabel inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_defineLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                     GALGAS_symbolTableForOptimizations & io_ioRoutineSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//          Category method '@pic18_intermediate_JUMP optimizeJUMP'          *
//                                                                           *
//---------------------------------------------------------------------------*

