pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.h
typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP) (const cPtr_pic_31__38__5F_intermediate_5F_JUMP * inObject,
                                                                                          const GALGAS_symbolTableForOptimizations constinArgument0,
                                                                                          const GALGAS_uint constinArgument1,
                                                                                          GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument2,
                                                                                          GALGAS_string & ioArgument3,
                                                                                          GALGAS_bool & ioArgument4,
                                                                                          C_Compiler * inCompiler
                                                                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeJUMP (const PMSInt32 inClassIndex,
                                       categoryMethodSignature_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeJUMP (const cPtr_pic_31__38__5F_intermediate_5F_JUMP * inObject,
                                      const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                      const GALGAS_uint constin_inLineIndex,
                                      GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                      GALGAS_string & io_ioListFileContents,
                                      GALGAS_bool & io_ioOptimizationsDone,
                                      C_Compiler * inCompiler
                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//           Category method '@pic18_intermediate_JSR optimizeJSR'           *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR) (const cPtr_pic_31__38__5F_intermediate_5F_JSR * inObject,
                                                                                        const GALGAS_symbolTableForOptimizations constinArgument0,
                                                                                        const GALGAS_uint constinArgument1,
                                                                                        GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument2,
                                                                                        GALGAS_string & ioArgument3,
                                                                                        GALGAS_bool & ioArgument4,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeJSR (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeJSR (const cPtr_pic_31__38__5F_intermediate_5F_JSR * inObject,
                                     const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                     GALGAS_string & io_ioListFileContents,
                                     GALGAS_bool & io_ioOptimizationsDone,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_literalOperation optimizeMOVLW'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                                                                                                      const GALGAS_uint constinArgument0,
                                                                                                                      GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument1,
                                                                                                                      GALGAS_string & ioArgument2,
                                                                                                                      GALGAS_bool & ioArgument3,
                                                                                                                      C_Compiler * inCompiler
                                                                                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeMOVLW (const PMSInt32 inClassIndex,
                                        categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeMOVLW (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                       const GALGAS_uint constin_inLineIndex,
                                       GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                       GALGAS_string & io_ioListFileContents,
                                       GALGAS_bool & io_ioOptimizationsDone,
                                       C_Compiler * inCompiler
                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_conditionalBranch optimizeBCC'*
//                                                                           *
//---------------------------------------------------------------------------*

