pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.h
typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * inObject,
                                                                                                                     const GALGAS_symbolTableForOptimizations constinArgument0,
                                                                                                                     const GALGAS_uint constinArgument1,
                                                                                                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument2,
                                                                                                                     GALGAS_string & ioArgument3,
                                                                                                                     GALGAS_bool & ioArgument4,
                                                                                                                     C_Compiler * inCompiler
                                                                                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeBCC (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeBCC (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * inObject,
                                     const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                     GALGAS_string & io_ioListFileContents,
                                     GALGAS_bool & io_ioOptimizationsDone,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Category method '@pic18_intermediate_jump_test_register optimizeTestReg'  *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg) (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * inObject,
                                                                                                                 const GALGAS_symbolTableForOptimizations constinArgument0,
                                                                                                                 const GALGAS_uint constinArgument1,
                                                                                                                 GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument2,
                                                                                                                 GALGAS_string & ioArgument3,
                                                                                                                 GALGAS_bool & ioArgument4,
                                                                                                                 C_Compiler * inCompiler
                                                                                                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeTestReg (const PMSInt32 inClassIndex,
                                          categoryMethodSignature_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeTestReg (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * inObject,
                                         const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                         const GALGAS_uint constin_inLineIndex,
                                         GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                         GALGAS_string & io_ioListFileContents,
                                         GALGAS_bool & io_ioOptimizationsDone,
                                         C_Compiler * inCompiler
                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_incDecRegisterInCondition optimizeTestDecInc'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc) (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * inObject,
                                                                                                                     const GALGAS_symbolTableForOptimizations constinArgument0,
                                                                                                                     const GALGAS_uint constinArgument1,
                                                                                                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument2,
                                                                                                                     GALGAS_string & ioArgument3,
                                                                                                                     GALGAS_bool & ioArgument4,
                                                                                                                     C_Compiler * inCompiler
                                                                                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeTestDecInc (const PMSInt32 inClassIndex,
                                             categoryMethodSignature_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeTestDecInc (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * inObject,
                                            const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                            const GALGAS_uint constin_inLineIndex,
                                            GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                            GALGAS_string & io_ioListFileContents,
                                            GALGAS_bool & io_ioOptimizationsDone,
                                            C_Compiler * inCompiler
                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_registerComparisonCondition optimizeCMP'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP) (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                                                                                                const GALGAS_symbolTableForOptimizations constinArgument0,
                                                                                                                const GALGAS_uint constinArgument1,
                                                                                                                GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument2,
                                                                                                                GALGAS_string & ioArgument3,
                                                                                                                GALGAS_bool & ioArgument4,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeCMP (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP inMethod) ;

//---------------------------------------------------------------------------*

