pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.h
void callCategoryMethod_optimizeCMP (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                     const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                     GALGAS_string & io_ioListFileContents,
                                     GALGAS_bool & io_ioOptimizationsDone,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_BitTestSkip optimizeBitTestSkip'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                                                                                                       const GALGAS_uint constinArgument0,
                                                                                                                       GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument1,
                                                                                                                       GALGAS_string & ioArgument2,
                                                                                                                       GALGAS_bool & ioArgument3,
                                                                                                                       C_Compiler * inCompiler
                                                                                                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeBitTestSkip (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeBitTestSkip (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                             const GALGAS_uint constin_inLineIndex,
                                             GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                             GALGAS_string & io_ioListFileContents,
                                             GALGAS_bool & io_ioOptimizationsDone,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
